{
    "version": "https://jsonfeed.org/version/1",
    "title": "getshredgo",
    "description": "",
    "home_page_url": "https://rish405.github.io/getshredgo",
    "feed_url": "https://rish405.github.io/getshredgo/feed.json",
    "user_comment": "",
    "author": {
        "name": "Rish"
    },
    "items": [
        {
            "id": "https://rish405.github.io/getshredgo/intermittent-fasting-101-the-ultimate-beginners-guide/",
            "url": "https://rish405.github.io/getshredgo/intermittent-fasting-101-the-ultimate-beginners-guide/",
            "title": "Intermittent Fasting 101 — The Ultimate Beginner’s Guide",
            "summary": "Intermittent fasting (IF) is currently one of the world’s most popular health and fitness trends. People are using it to&hellip;",
            "content_html": "<h3>Intermittent fasting (IF) is currently one of the world’s most popular health and fitness trends.</h3>\n<p>People are using it to lose weight, improve their health and simplify their lifestyles.</p>\n<p>Many studies show that it can have powerful effects on your body and brain and may even help you live longer.</p>\n<p>This is the ultimate beginner’s guide to intermittent fasting.</p>\n<h1><figure class=\"is-loaded\"><img  src=\"https://miro.medium.com/max/1400/0*qOq0qMHRgzoLXu-A\" data-is-external-image=\"true\"  alt=\"\" width=\"1400\" height=\"807\" loading=\"lazy\" data-is-external-image=\"true\"></figure></h1>\n<h3>What Is Intermittent Fasting (IF)?</h3>\n<p>Intermittent fasting (IF) is an eating pattern that cycles between periods of fasting and eating.</p>\n<p>It doesn’t specify which foods you should eat but rather <em class=\"mw\">when</em> you should eat them.</p>\n<p>In this respect, it’s not a diet in the conventional sense but more accurately described as an eating pattern.</p>\n<p>Common intermittent fasting methods involve daily 16-hour fasts or fasting for 24 hours, twice per week.</p>\n<p>Fasting has been a practice throughout human evolution. Ancient hunter-gatherers didn’t have supermarkets, refrigerators or food available year-round. Sometimes they couldn’t find anything to eat.</p>\n<p>As a result, humans evolved to be able to function without food for extended periods of time.</p>\n<p>In fact, fasting from time to time is more natural than always eating 3–4 (or more) meals per day.</p>\n<p>Fasting is also often done for religious or spiritual reasons, including in Islam, Christianity, Judaism and Buddhism.</p>\n<h1><figure class=\"is-loaded\"><img  src=\"https://miro.medium.com/max/1400/0*d0nGsMwHS2O5GPBV\" data-is-external-image=\"true\"  alt=\"\" width=\"1400\" height=\"927\" loading=\"lazy\" data-is-external-image=\"true\"></figure></h1>\n<h3>Intermittent Fasting Methods</h3>\n<p>There are several different ways of doing intermittent fasting — all of which involve splitting the day or week into eating and fasting periods.</p>\n<p>During the fasting periods, you eat either very little or nothing at all.</p>\n<p>These are the most popular methods:</p>\n<ul>\n<li><strong class=\"ks jj\">The 16/8 method:</strong> Also called the Leangains protocol, it involves skipping breakfast and restricting your daily eating period to 8 hours, such as 1–9 p.m. Then you fast for 16 hours in between.</li>\n<li><strong class=\"ks jj\">Eat-Stop-Eat:</strong> This involves fasting for 24 hours, once or twice a week, for example by not eating from dinner one day until dinner the next day.</li>\n<li><strong class=\"ks jj\">The 5:2 diet:</strong> With this method, you consume only 500–600 calories on two nonconsecutive days of the week, but eat normally the other 5 days.</li>\n</ul>\n<p>By reducing your calorie intake, all of these methods should cause weight loss as long as you don’t compensate by eating much more during the eating periods.</p>\n<p>Many people find the 16/8 method to be the simplest, most sustainable and easiest to stick to. It’s also the most popular.</p>\n<h1><figure class=\"is-loaded\"><img  src=\"https://miro.medium.com/max/1400/0*vZudnmIUJlyxG0XH\" data-is-external-image=\"true\"  alt=\"\" width=\"1400\" height=\"933\" loading=\"lazy\" data-is-external-image=\"true\"></figure></h1>\n<h3>How It Affects Your Cells and Hormones</h3>\n<p>When you fast, several things happen in your body on the cellular and molecular level.</p>\n<p>For example, your body adjusts hormone levels to make stored body fat more accessible.</p>\n<p>Your cells also initiate important repair processes and change the expression of genes.</p>\n<p>Here are some changes that occur in your body when you fast:</p>\n<ul>\n<li><strong class=\"ks jj\">Human Growth Hormone (HGH):</strong> The levels of growth hormone skyrocket, increasing as much as 5-fold. This has benefits for fat loss and muscle gain, to name a few.</li>\n<li><strong class=\"ks jj\">Insulin:</strong> Insulin sensitivity improves and levels of insulin drop dramatically. Lower insulin levels make stored body fat more accessible.</li>\n<li><strong class=\"ks jj\">Cellular repair:</strong> When fasted, your cells initiate cellular repair processes. This includes autophagy, where cells digest and remove old and dysfunctional proteins that build up inside cells.</li>\n<li><strong class=\"ks jj\">Gene expression:</strong> There are changes in the function of genes related to longevity and protection against disease.</li>\n</ul>\n<p>These changes in hormone levels, cell function and gene expression are responsible for the health benefits of intermittent fasting.</p>\n<h1><figure class=\"is-loaded\"><img  src=\"https://miro.medium.com/max/1400/0*nZyKxXzMaUYSN00P\" data-is-external-image=\"true\"  alt=\"\" width=\"1400\" height=\"787\" loading=\"lazy\" data-is-external-image=\"true\"></figure></h1>\n<h3>Health Benefits</h3>\n<p>Many studies have been done on intermittent fasting, in both animals and humans.</p>\n<p>These studies have shown that it can have powerful benefits for weight control and the health of your body and brain. It may even help you live longer.</p>\n<p>Here are the main health benefits of intermittent fasting:</p>\n<ul>\n<li><strong class=\"ks jj\">Weight loss:</strong> As mentioned above, intermittent fasting can help you lose weight and belly fat, without having to consciously restrict calories.</li>\n<li><strong class=\"ks jj\">Insulin resistance:</strong> Intermittent fasting can reduce insulin resistance, lowering blood sugar by 3–6% and fasting insulin levels by 20–31%, which should protect against type 2 diabetes (1).</li>\n<li><strong class=\"ks jj\">Inflammation:</strong> Some studies show reductions in markers of inflammation, a key driver of many chronic diseases.</li>\n<li><strong class=\"ks jj\">Heart health:</strong> Intermittent fasting may reduce “bad” LDL cholesterol, blood triglycerides, inflammatory markers, blood sugar and insulin resistance — all risk factors for heart disease.</li>\n</ul>\n<h1><figure class=\"is-loaded\"><img  src=\"https://miro.medium.com/max/1400/0*oYEnmXbIyfhGK5dj\" data-is-external-image=\"true\"  alt=\"\" width=\"1400\" height=\"844\" loading=\"lazy\" data-is-external-image=\"true\"></figure></h1>\n<h3>Makes Your Healthy Lifestyle Simpler</h3>\n<p>Eating healthy is simple, but it can be incredibly hard to maintain.</p>\n<p>One of the main obstacles is all the work required to plan for and cook healthy meals.</p>\n<p>Intermittent fasting can make things easier, as you don’t need to plan, cook or clean up after as many meals as before.</p>\n<p>For this reason, intermittent fasting is very popular among the life-hacking crowd, as it improves your health while simplifying your life at the same time.</p>\n<h1><figure class=\"is-loaded\"><img  src=\"https://miro.medium.com/max/1400/0*RiFOyEzD5dfjmqAq\" data-is-external-image=\"true\"  alt=\"\" width=\"1400\" height=\"1120\" loading=\"lazy\" data-is-external-image=\"true\"></figure></h1>\n<h3>Safety and Side Effects</h3>\n<p>Hunger is the main side effect of intermittent fasting.</p>\n<p>You may also feel weak and your brain may not perform as well as you’re used to.</p>\n<p>This may only be temporary, as it can take some time for your body to adapt to the new meal schedule.</p>\n<p>If you have a medical condition, you should consult with your doctor before trying intermittent fasting.</p>\n<p>This is particularly important if you:</p>\n<ul>\n<li>Have diabetes.</li>\n<li>Have problems with blood sugar regulation.</li>\n<li>Have low blood pressure.</li>\n<li>Take medications.</li>\n<li>Are underweight.</li>\n<li>Have a history of eating disorders.</li>\n<li>Are a woman who is trying to conceive.</li>\n<li>Are a woman with a history of amenorrhea.</li>\n<li>Are pregnant or breastfeeding.</li>\n</ul>\n<p>All that being said, intermittent fasting has an outstanding safety profile. There is nothing dangerous about not eating for a while if you’re healthy and well-nourished overall.</p>\n<h1><figure class=\"is-loaded\"><img  src=\"https://miro.medium.com/max/1400/0*UqeirOWkzaxKzO9V\" data-is-external-image=\"true\"  alt=\"\" width=\"1400\" height=\"933\" loading=\"lazy\" data-is-external-image=\"true\"></figure></h1>\n<h3>Frequently Asked Questions</h3>\n<p>Here are answers to the most common questions about intermittent fasting.</p>\n<h4 id=\"b88b\" class=\"lt lu ji bn lv lw lx ly lz ma mb mc md me mf mg mh mi mj mk ml mm mn mo mp mq hj\">1. Can I Drink Liquids During the Fast?</h4>\n<p>Yes. Water, coffee, tea and other non-caloric beverages are fine. Do not add sugar to your coffee. Small amounts of milk or cream may be okay.</p>\n<p>Coffee can be particularly beneficial during a fast, as it can blunt hunger.</p>\n<h4 id=\"a98e\" class=\"lt lu ji bn lv lw lx ly lz ma mb mc md me mf mg mh mi mj mk ml mm mn mo mp mq hj\">2. Isn’t It Unhealthy to Skip Breakfast?</h4>\n<p>No. The problem is that most stereotypical breakfast skippers have unhealthy lifestyles. If you make sure to eat healthy food for the rest of the day then the practice is perfectly healthy.</p>\n<h4 id=\"7dc6\" class=\"lt lu ji bn lv lw lx ly lz ma mb mc md me mf mg mh mi mj mk ml mm mn mo mp mq hj\">3. Can I Take Supplements While Fasting?</h4>\n<p>Yes. However, keep in mind that some supplements like fat-soluble vitamins may work better when taken with meals.</p>\n<h4 id=\"3f0e\" class=\"lt lu ji bn lv lw lx ly lz ma mb mc md me mf mg mh mi mj mk ml mm mn mo mp mq hj\">4. Can I Work out While Fasted?</h4>\n<p>Yes, fasted workouts are fine. Some people recommend taking branched-chain amino acids (BCAAs) before a fasted workout.</p>\n<h4 id=\"6346\" class=\"lt lu ji bn lv lw lx ly lz ma mb mc md me mf mg mh mi mj mk ml mm mn mo mp mq hj\">5. Will Fasting Cause Muscle Loss?</h4>\n<p>All weight loss methods can cause muscle loss, which is why it’s important to lift weights and keep your protein intake high. One study showed that intermittent fasting causes less muscle loss than regular calorie restriction.</p>\n<h4 id=\"2cff\" class=\"lt lu ji bn lv lw lx ly lz ma mb mc md me mf mg mh mi mj mk ml mm mn mo mp mq hj\">6. Will Fasting Slow Down My Metabolism?</h4>\n<p>No. Studies show that short-term fasts actually boost metabolism. However, longer fasts of 3 or more days can suppress metabolism.</p>\n<h4 id=\"b7f2\" class=\"lt lu ji bn lv lw lx ly lz ma mb mc md me mf mg mh mi mj mk ml mm mn mo mp mq hj\">7. Should Kids Fast?</h4>\n<p>Allowing your child to fast is probably a bad idea.</p>",
            "author": {
                "name": "Rish"
            },
            "tags": [
            ],
            "date_published": "2022-09-28T23:09:15+05:30",
            "date_modified": "2022-09-28T23:09:15+05:30"
        },
        {
            "id": "https://rish405.github.io/getshredgo/everything-you-need-to-know-about-high-cholesterol/",
            "url": "https://rish405.github.io/getshredgo/everything-you-need-to-know-about-high-cholesterol/",
            "title": "Everything You Need to Know About High Cholesterol",
            "summary": "High cholesterol is a pretty common issue everywhere. However, because this condition can often present without any real symptoms, you&hellip;",
            "content_html": "<p>High cholesterol is a pretty common issue everywhere. However, because this condition can often present without any real symptoms, you may not even know you have it until you visit your doctor.</p>\n<p>If you’re wondering what causes high cholesterol, what to do if you’ve been diagnosed with it, and if there are ways to reverse it (hint: there are), read on for all the answers.</p>\n<h1>What is Cholesterol?</h1>\n<p>Cholesterol is a type of lipid. It’s a waxy, fat-like substance that your liver produces naturally. It’s vital for the formation of cell membranes, certain hormones, and vitamin D.</p>\n<p>Cholesterol doesn’t dissolve in water, so it can’t travel through your blood on its own. To help transport cholesterol, your liver produces lipoproteins.</p>\n<p>Lipoproteins are particles made from fat and protein. They carry cholesterol and triglycerides, another type of lipid, through your bloodstream. The two major forms of lipoprotein are low-density lipoprotein (LDL) and high-density lipoprotein (HDL).</p>\n<p>LDL cholesterol is any cholesterol carried by low-density lipoproteins. If your blood contains too much LDL cholesterol, you may be diagnosed with high cholesterol. Without treatment, high cholesterol may lead to many health issues, including heart attack and stroke.</p>\n<p>High cholesterol rarely causes symptoms in the beginning. That’s why it’s important to get your cholesterol levels checked on a regular basis.</p>\n<p><img src=\"https://miro.medium.com/max/1400/0*9AVWpq5GuM9M-wbN\" data-is-external-image=\"true\"  alt=\"\" width=\"1400\" height=\"1225\" loading=\"lazy\" data-is-external-image=\"true\"></p>\n<h1>High cholesterol symptoms</h1>\n<p>In most cases, high cholesterol is a “silent” condition. It typically doesn’t cause any symptoms. Many people don’t even realize they have high cholesterol until they develop serious complications, such as a heart attack or stroke.</p>\n<p>That’s why routine cholesterol screening is important. If you’re 20 years or older, ask your doctor if you should have routine cholesterol screening. Learn how this screening could potentially save your life.</p>\n<p><img src=\"https://miro.medium.com/max/1400/0*w3X5HzuIrUKCInjE\" data-is-external-image=\"true\"  alt=\"\" width=\"1400\" height=\"933\" loading=\"lazy\" data-is-external-image=\"true\"></p>\n<h1>LDL cholesterol, or “bad cholesterol”</h1>\n<p>LDL cholesterol is often called “bad cholesterol.” It carries cholesterol to your arteries. If your levels of LDL cholesterol are too high, it can build up on the walls of your arteries.</p>\n<p>This buildup is also known as cholesterol plaque. This plaque can narrow your arteries, limit your blood flow, and raise your risk of blood clots. If a blood clot blocks an artery in your heart or brain, it can cause a heart attack or stroke.</p>\n<p><img src=\"https://miro.medium.com/max/1400/1*1K46opT61zXQyH7ArYfJmw.jpeg\" data-is-external-image=\"true\"  alt=\"\" width=\"1400\" height=\"933\" loading=\"lazy\" data-is-external-image=\"true\"></p>\n<h1>HDL cholesterol, or “good cholesterol”</h1>\n<p>HDL cholesterol is sometimes called “good cholesterol.” It helps return LDL cholesterol to your liver to be removed from your body. This helps prevent cholesterol plaque from building up in your arteries.</p>\n<p>When you have healthy levels of HDL cholesterol, it can help lower your risk of blood clots, heart disease, and stroke.</p>\n<h1>Triglycerides, a different type of lipid</h1>\n<p>Triglycerides are another type of lipid. They’re different from cholesterol. While your body uses cholesterol to build cells and certain hormones, it uses triglycerides as a source of energy.</p>\n<p>When you eat more calories than your body can use right away, it converts those calories into triglycerides. It stores triglycerides in your fat cells. It also uses lipoproteins to circulate triglycerides through your bloodstream.</p>\n<p>If you regularly eat more calories than your body can use, your triglyceride levels may become too high. This can raise your risk of several health problems, including heart disease and stroke.</p>\n<p><img src=\"https://miro.medium.com/max/1400/0*wCGpJQFoOlIrOxns\" data-is-external-image=\"true\"  alt=\"\" width=\"1400\" height=\"528\" loading=\"lazy\" data-is-external-image=\"true\"></p>\n<h1>Getting your cholesterol levels checked</h1>\n<p>If you’re 20 years or older, it’s recommended getting your cholesterol levels checked at least once every 4 to 6 years. If you have a history of high cholesterol or other risk factors for cardiovascular disease, your doctor may encourage you to get your cholesterol levels tested more often.</p>\n<p>Your doctor can use a lipid panel to measure your total cholesterol level, as well your LDL cholesterol, HDL cholesterol, and triglyceride levels. Your total cholesterol level is the overall amount of cholesterol in your blood. It includes LDL and HDL cholesterol.</p>\n<p>If your levels of total cholesterol or LDL cholesterol are too high, your doctor may diagnose you with high cholesterol. High cholesterol can be dangerous when your LDL levels are too high and your HDL levels are too low.</p>\n<h1>Risk factors for high cholesterol</h1>\n<p>You may be at a higher risk of developing high cholesterol if you:</p>\n<ul>\n<li><em class=\"ni\">are living with obesity</em></li>\n<li><em class=\"ni\">have limited physical activity</em></li>\n<li><em class=\"ni\">consume a lot of saturated and trans fats, like those found in fast food</em></li>\n<li><em class=\"ni\">smoke tobacco products</em></li>\n<li><em class=\"ni\">have a family history of high cholesterol</em></li>\n<li><em class=\"ni\">have diabetes, kidney disease, or hypothyroidism</em></li>\n</ul>\n<p>People of all ages, genders, and ethnicities can have high cholesterol.</p>\n<p><img src=\"https://miro.medium.com/max/1400/0*os7aH4P-bG6W063T\" data-is-external-image=\"true\"  alt=\"\" width=\"1400\" height=\"933\" loading=\"lazy\" data-is-external-image=\"true\"></p>\n<h1>Complications of high cholesterol</h1>\n<p>Without treatment, high cholesterol can cause plaque to build up in your arteries. Over time, this plaque can narrow your arteries. This condition is known as atherosclerosis.</p>\n<p>Atherosclerosis is a serious condition. It can limit the flow of blood through your arteries. It also raises your risk of developing dangerous blood clots.</p>\n<p>Atherosclerosis can result in many life threatening complications, such as:</p>\n<ul>\n<li>stroke</li>\n<li>heart attack</li>\n<li>angina, or chest pain</li>\n<li>high blood pressure</li>\n<li>peripheral vascular disease</li>\n<li>chronic kidney disease</li>\n</ul>\n<p>High cholesterol can also create a bile imbalance, raising your risk of gallstones.</p>\n<p><img src=\"https://miro.medium.com/max/1400/0*hvMt6USFzNKGy08z\" data-is-external-image=\"true\"  alt=\"\" width=\"1400\" height=\"933\" loading=\"lazy\" data-is-external-image=\"true\"></p>\n<h1>Lowering cholesterol through diet</h1>\n<p>To help you achieve and maintain healthy cholesterol levels, your doctor may recommend changes to your diet.</p>\n<p>For example, they may advise you to:</p>\n<ul>\n<li>limit your intake of foods that are high in cholesterol, saturated fats, and trans fats</li>\n<li>choose lean sources of protein, such as chicken, fish, and legumes</li>\n<li>eat a wide variety of high fiber foods, such as fruits, vegetables, and whole grains</li>\n<li>opt for baked, broiled, steamed, grilled, and roasted foods instead of fried foods</li>\n<li>avoid fast food and sugary, pre-packaged options when possible</li>\n</ul>\n<p>Foods that are high in cholesterol, saturated fats, or trans fats include:</p>\n<ul>\n<li>red meat, organ meats, egg yolks, and high fat dairy products</li>\n<li>processed foods made with cocoa butter or palm oil</li>\n<li>deep-fried foods, such as potato chips, onion rings, and fried chicken</li>\n<li>certain baked goods, such as some cookies and muffins</li>\n</ul>\n<p>Eating fish and other foods that contain omega-3 fatty acids may also help lower your LDL levels. For example, salmon, mackerel, and herring are rich sources of omega-3s. Walnuts, almonds, ground flaxseeds, and avocados also contain omega-3s.</p>\n<p><img src=\"https://miro.medium.com/max/1400/0*UviemJjKzklh3FHY\" data-is-external-image=\"true\"  alt=\"\" width=\"1400\" height=\"933\" loading=\"lazy\" data-is-external-image=\"true\"></p>\n<h1>How to prevent high cholesterol</h1>\n<p>You can’t control the genetic risk factors for high cholesterol. However, lifestyle factors can be managed.</p>\n<p>To lower your risk of developing high cholesterol:</p>\n<ul>\n<li>Eat a nutritious diet that’s low in cholesterol and animal fats, and high in fiber.</li>\n<li>Avoid excessive alcohol consumption.</li>\n<li>Maintain a moderate weight.</li>\n<li>Exercise regularly.</li>\n<li>Avoid smoking.</li>\n</ul>\n<p>Follow your doctor’s recommendations for routine cholesterol screening. If you’re at risk of high cholesterol or coronary heart disease, they will likely encourage you to get your cholesterol levels tested on a regular basis.</p>\n<h1>Takeaway</h1>\n<p>In most cases, high cholesterol has no symptoms. But without treatment, high cholesterol can cause serious health issues. The good news is that your doctor can help you manage this condition, and in many cases, can help you avoid complications.</p>\n<p>To learn if you have high cholesterol, ask your doctor to test your cholesterol levels, especially if you’re 20 years or older. If they diagnose you with high cholesterol, ask them about your treatment options.</p>\n<p>To lower your risk of complications from high cholesterol, practice healthy lifestyle habits and follow your doctor’s recommended treatment plan.</p>\n<p>Eating a balanced diet, exercising regularly, and avoiding tobacco products may help you achieve and maintain healthy cholesterol levels. It could also help lower your risk of complications from high cholesterol.</p>",
            "author": {
                "name": "Rish"
            },
            "tags": [
            ],
            "date_published": "2022-09-28T21:50:06+05:30",
            "date_modified": "2022-09-28T23:03:09+05:30"
        }
    ]
}
